Repository: Daniel-KM/Omeka-S-module-OaiPmhRepository
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: OAI-PMH Repository
fr: Entrepôt OAI-PMH

source: Global repository
fr: Entrepôt général

source: Without oai sets
fr: Sans les lots oai

source: With item sets as oai sets
fr: Avec les collections en tant que lots oai

source: With a specific list of item sets as oai sets
fr: Avec une liste de collections en tant que lots oai

source: With dynamic oai sets from queries
fr: Avec des lots oai dynamiques à partir de recherches

source: With sites as oai sets
fr: Avec les sites en tant que lots oai

source: Disabled.
fr: Désactivé.

source: Site repositories
fr: Entrepôts par site

source: Without oai sets.
fr: Sans les lots oai.

source: No site.
fr: Aucun site.

source: The event "oaipmhrepository.values" that may be used by other modules was deprecated and replaced by event "oaipmhrepository.values.pre".
fr: L’événement "oaipmhrepository.values" qui pouvait être utilisé par d'autres modules est obsolète et a été remplacé par l’événement "oaipmhrepository.values.pre".

source: Futhermore, a new option allows to map any term to any other term, so any values can be exposed if needed.
fr: De plus, une nouvelle option permet de faire correspondre n'importe quels termes afin d'exposer toutes les valeurs, si besoin.

source: It is now possible to define oai sets with a specific list of item sets or with a list of search queries.
fr: Il est désormais possible de définir des lots oai avec un liste spécifique de collections ou avec une liste de requêtes de recherche avancée.

source: A simple mapping of foaf properties to Dublin Core has been added to the default config. It allows to publish, for example, common metadata of people.
fr: Un alignement simple entre les propriétés foaf et Dublin Core a été ajouté à la configuration par défaut. Cela permet de publier, par exemple, les métadonnées courantes des personnes.

source: You can copy the {link}default mapping foaf to dcterms{link_end} in the config of the module if needed.
fr: Vous pouvez copier {link}l’alignement par défaut entre foaf et dcterms{link_end} dans la configuration du module si besoin.

source: An option was added to append a thumbnail url according to the non-standard %1$srecommandation%2$s of the Bibliothèque nationale de France.
fr: Une option a été ajoutée pour inclure une url vers la vignette, conformément aux %1$srecommandations%2$s non standard de la Bibliothèque nationale de France.

source: The deprecated event "oaipmhrepository.values" was removed. Use "oaipmhrepository.values.pre" instead.
fr: L’événement obsolète "oaipmhrepository.values" a été supprimé. Utiliser "oaipmhrepository.values.pre" à la place.

source: A new output metadata format was added, "simple_xml", that contains all the values in a simple xml, not only the dublin core ones. You can disabled it in the {link}config of the module{link_end}.
fr: Un nouveau format de métadonnées a été ajouté, « simple_xml ». Il contient toutes les valeurs et pas seulement celles du Dublin Core. Vous pouvez le désactiver dans la {link}configuration du module{link_end}.

source: Some new options were added for compliance with non-standard requirements of BnF (Bibliothèque nationale de France): thumbnail, uri without attribute, class as main type.
fr: De nouvelles options ont été ajoutées en conformité avec les recommandations non standard de la Bibliothèque nationale de France : vignette, uri sans attribut, classe en tant que type général.

source: Repository name
fr: Nom de l’entrepôt

source: Name for this OAI-PMH repository.
fr: Nom de cette entrepôt OAI-PMH.

source: Namespace identifier
fr: Identifiant de l’espace de nom

source: This will be used to form globally unique IDs for the exposed metadata items. This value is required to be a domain name you have registered. Using other values will generate invalid identifiers.
fr: Cette valeur est utilisée pour créer des IDs globalement uniques pour exposer les notices. Elle doit être liée à un domaine enregistrée. Utiliser une autre valeur créera des identifiants invalides.

source: Metadata formats
fr: Formats des métadonnées

source: The format that will be made available. oai_dc is required.
fr: Format qui sera rendu disponible. oai_dc est obligatoire.

source: Select formats
fr: Choisir les formats

source: Expose media
fr: Exposer les médias

source: Whether the plugin should include identifiers for the files associated with items. This provides harvesters with direct access to files.
fr: Indique si le module doit inclure les identifiants pour les fichiers associés aux contenus. Cela donne un accès direct aux fichiers pour les moissonneurs.

source: Hide empty oai sets
fr: Cacher les lots vides

source: Whether the module should hide empty oai sets.
fr: Indique si le module doit cacher les lots oai vides.

source: The global repository contains all the resources of Omeka S, in one place. Note that the oai set identifiers are different (item set id or site id).
fr: L’entrepôt général contient toutes les ressources d’Omeka S, dans une seule url. Noter que les identifiants des lots oai sont différents (id de collection ou de site).

source: Disabled
fr: Désactivé

source: With the list of item sets below
fr: Avec la liste de collections ci-dessous

source: With dynamic sets defined by queries below
fr: Avec des lots dynamiques définis avec les requêtes ci-dessous

source: List of item sets for the global repository
fr: Liste des collections pour l’entrepôt général

source: Select item sets…
fr: Choisir des collections…

source: Dynamic sets based on advanced search queries
fr: Lots dynamiques basés sur des requêtes de recherche avancée

source: The site repositories simulate multiple oai servers, with the site pools of items and the attached item sets as oai sets.
fr: Les entrepôts des sites simulent plusieurs serveurs OAI, avec le réservoir de contenus du site et les collections attachées en tant que lot oai.

source: Add identifier for global repository
fr: Ajouter l’identifiant pour l’entrepôt général

source: An identifier may be added to simplify harvests, in particular when there is no unique identifier (ark, noid, call number, etc.). Only one identifier may be added and it can be the api url or a site specific url. Some formats add their own identifier and other ones skip this option.
fr: Un identifiant peut être ajouté pour simplifier les moissonnages, notamment quand il n’y a pas d’identifiant unique (ark, noid, cote, etc.). Seul un identifiant peut être ajouté et ce peut être l’url api ou l’url spécifique du site. Certains formats ajoutent leur propre identifiant et d’autres ignorent cette option.

source: Api url
fr: Url de l’api

source: Relative site url
fr: Url relative du site

source: Absolute site url
fr: Url absolue du site

source: Add identifier for site repositories
fr: Ajouter l’identifiant pour les entrepôts des sites

source: Oai set format
fr: Format des lots Oai

source: The format of the oai set identifiers.
fr: Le format des identifiants des lots oai.

source: Genericize dcterms for specific formats
fr: Convertir le Dublin Core Terms en Dublin Core Elements pour certains formats

source: Use refined terms for Dublin Core elements, for example dcterms:abstract will be merged with dc:description. It allows to expose all metadata in the standard oai_dc. For other merges, the event "oaipmhrepository.values.pre" can be used.
fr: Utiliser les termes raffinés pour le Dublin Core Éléments, par exemple dcterms:abstract sera fusionné dans dc:description. Cela permet d’exposer toutes les métadonnées ans le format standard oai_dc. Pour les autres fusion, l’événement "oaipmhrepository.values.pre" peut être utilisé.

source: Map properties
fr: Correspondance des propriétés

source: Map any property to any other property, so they will be available in other formats, in particular "oai_dcterms" and "oai_dc".
fr: Correspondance entre toutes propriétés afin de les rendre disponibles dans tous les formats, notamment "oai_dcterms" et "oa_dc".

source: Format of linked resources
fr: Format des ressources liées

source: Omeka url as text and title as attribute
fr: Url Omeka comme texte et titre comme attribut

source: Title as text and Omeka url as attribute
fr: Titre comme texte et url Omeka comme attribut

source: Omeka url and title
fr: Url Omeka et titre

source: Omeka url
fr: Url Omeka

source: Omeka url as text
fr: Url Omeka comme texte

source: Identifier (property below)
fr: Identifiant (propriété ci-dessous)

source: Identifier or id
fr: Identifiant ou id

source: Property for linked resources
fr: Propriété pour les ressources liées

source: Format of uri
fr: Format de l’uri

source: Uri as text and label as attribute
fr: Uri comme texte et libellé comme attribut

source: Label as text and uri as attribute
fr: Libellé comme texte et uri comme attribut

source: Uri and label separated by a space
fr: Uri et libellé séparés par une espace

source: Uri only
fr: Uri seulement

source: Label only
fr: Libellé seul

source: Label if any else uri
fr: Libellé sinon uri

source: Uri only as text (BnF compliance: no attribute for uri)
fr: Uri seulement comme texte (conformité BnF : pas d’attribut pour l’uri)

source: Dublin Core: Add the class as Dublin Core type
fr: Dublin Core : ajouter la classe en tant que type Dublin Core

source: For compliance with non-standard requirements of BnF, use a table to map to main types.
fr: Pour être en conformité avec les recommandations non standard de la Bibliothèque nationale de France, il convient d’utiliser une table pour aligner les grands types.

source: Local name
fr: Nom local

source: Map via module Table (for example map class to "text", "image", "sound", "video")
fr: Aligner via le module Table (par exemple aligner la classe avec « text », « image », « sound », « video »)

source: Dublin Core terms: Add the class as Dublin Core type
fr: Dublin Core terms : ajouter la classe comme Dublin Core type

source: Map via module Table
fr: Aligner via le module Table

source: Dublin Core: Table to use when option above is "table"
fr: Dublin Core : Table pour l’option « table » ci-dessus

source: Dublin Core: Append the url of the thumbnail for BnF
fr: Dublin Core : ajouter l’url de la vignette pour la BnF

source: For compliance with the non-standard recommandations of the Bibliothèque nationale de France, the url of the main thumbnail may be automatically included to records.
fr: En conformité avec les recommandations non standard de la Bibliothèque nationale de France, l’url de la vignette principale peut être ajoutée automatiquement aux notices.

source: Square
fr: Carré

source: Dublin Core terms: Append the url of the thumbnail
fr: Dublin Core terms : ajouter l’url de la vignette

source: Mets: data format for item
fr: Mets : format des données des contenus

source: The format of the metadata of item.
fr: Le format des métadonnées d’un contenu.

source: Mets: data format for media
fr: Mets : format des données des médias

source: The format of the metadata of media.
fr: Le format des métadonnées d’un média.

source: Human interface
fr: Interface web

source: The OAI-PMH pages can be displayed with a themable responsive human interface based on Bootstrap (https://getbootstrap.com).
fr: Les pages OAI-PMH peuvent être affichées avec un thème adaptatif lisible par les personnes, basé sur Bootstrap (https://getbootstrap.com).

source: Global repository redirect route
fr: Route spécifique pour l’entrepôt général

source: An alias (redirect 301) for backward compatibility with Omeka Classic, that used "/oai-pmh-repository/request", or any other old OAI-PMH repository.
fr: Un alias (redirect 301) pour compatibilité ascendante avec Omeka Classic, qui utilisait "/oai-pmh-repository/request", ou tout autre entrepôt OAI-PMH.

source: List limit
fr: Limite de la liste

source: Number of individual records that can be returned in a response at once. Larger values will increase memory usage but reduce the number of database queries and HTTP requests. Smaller values will reduce memory usage but increase the number of DB queries and requests.
fr: Le nombre de notices individuelles qui peuvent être retournée en une seule réponse. Une valeur plus grande implique une utilisation plus intensive de la mémoire, mais réduit le requêtes http. Une valeur plus petite réduit l’usage de la mémoire, mais augmente le nombre de requêtes.

source: Token expiration time
fr: Durée avant expiration du jeton

source: In minutes, the length of time a resumption token is valid for. This means harvesters can re-try old partial list requests for this amount of time. Larger values will make the tokens table grow somewhat larger.
fr: La durée de validité d’un jeton de poursuite du moissonnage en minutes. Il permet aux moissonneurs de reprendre un ancien moissonnage. Une grande valeur implique que la table des jetons grossira davantage.

source: No verb specified.
fr: Pas de verbe spécifié.

source: The OAI-PMH protocol version 2.0 supports only "GET" and "POST" requests, not "%s".
fr: Le protocole OAI-PMH version 2.0 gère uniquement les requêtes "GET" et "POST", pas "%s".

source: Duplicate arguments in request.
fr: Arguments en doublon dans la requête.

source: Missing required argument %s.
fr: Il manque un argument obligatoire : %s.

source: Unknown argument %s.
fr: Argument inconnu : %s.

source: Invalid date/time argument.
fr: Argument date / heure invalide.

source: Date/time arguments of differing granularity.
fr: Arguments date / heure de granularité différente.

source: The set "%s" doesn’t exist.
fr: Le lot "%s" n’existe pas.

source: No records match the given criteria.
fr: Aucune notice ne correspond aux arguments.

source: Missing set format configuration
fr: Il manque la configuation du format du lot

source: Missing metadata format configuration
fr: Il manque la configuration du format des métadonnées
